{
  "constitution": {
    "title": "The Constitution of Kenya",
    "preamble": "",
    "chapters": [
      {
        "number": "ONE",
        "title": "Sovereignty of the People and Supremacy of this Constitution",
        "articles": [
          {
            "local_number": "1",
            "global_number": "1",
            "title": "Sovereignty of the people.",
            "clauses": [
              {
                "number": "1",
                "text": "(1) All sovereign power belongs to the people of Kenya and shall be exercised only in accordance with this Constitution.",
                "sub_clauses": [
                  {
                    "letter": "a",
                    "text": "The people may exercise their sovereign power either directly or through their democratically elected representatives."
                  },
                  {
                    "letter": "b",
                    "text": "Sovereign power under this Constitution is delegated to the following State organs, which shall perform their functions in accordance with this Constitution—"
                  },
                  {
                    "letter": "c",
                    "text": "Parliament and the legislative assemblies in the county governments;"
                  },
                  {
                    "letter": "d",
                    "text": "the national executive and the executive structures in the county governments; and"
                  },
                  {
                    "letter": "e",
                    "text": "the Judiciary and independent tribunals."
                  },
                  {
                    "letter": "f",
                    "text": "The sovereign power of the people is exercised at—"
                  },
                  {
                    "letter": "g",
                    "text": "the national level; and"
                  },
                  {
                    "letter": "h",
                    "text": "the county level."
                  }
                ]
              }
            ]
          },
          {
            "local_number": "2",
            "global_number": "2",
            "title": "Supremacy of this Constitution.",
            "clauses": [
              {
                "number": "1",
                "text": "(1) This Constitution is the supreme law of the Republic and binds all persons and all State organs at both levels of government.",
                "sub_clauses": [
                  {
                    "letter": "a",
                    "text": "No person may claim or exercise State authority except as authorised under this Constitution."
                  },
                  {
                    "letter": "b",
                    "text": "The validity or legality of this Constitution is not subject to challenge by or before any court or other State organ."
                  },
                  {
                    "letter": "c",
                    "text": "Any law, including customary law, that is inconsistent with this Constitution is void to the extent of the inconsistency, and any act or omission in contravention of this Constitution is invalid."
                  },
                  {
                    "letter": "d",
                    "text": "The general rules of international law shall form part of the law of Kenya."
                  },
                  {
                    "letter": "e",
                    "text": "Any treaty or convention ratified by Kenya shall form part of the law of Kenya under this Constitution."
                  }
                ]
              }
            ]
          },
          {
            "local_number": "3",
            "global_number": "3",
            "title": "Defence of this Constitution.",
            "clauses": [
              {
                "number": "1",
                "text": "(1) Every person has an obligation to respect, uphold and defend this Constitution.",
                "sub_clauses": []
              },
              {
                "number": "2",
                "text": "(2) Any attempt to establish a government otherwise than in compliance with this Constitution is unlawful.",
                "sub_clauses": []
              }
            ]
          }
        ],
        "parts": [],
        "preamble": ""
      },
      {
        "number": "TWO",
        "title": "The Republic",
        "articles": [
          {
            "local_number": "1",
            "global_number": "4",
            "title": "Declaration of the Republic.",
            "clauses": [
              {
                "number": "1",
                "text": "(1) Kenya is a sovereign Republic.",
                "sub_clauses": []
              },
              {
                "number": "2",
                "text": "(2) The Republic of Kenya shall be a multi-party democratic State founded on the national values and principles of governance referred to in Article 10.",
                "sub_clauses": []
              }
            ]
          },
          {
            "local_number": "2",
            "global_number": "5",
            "title": "Territory of Kenya.",
            "clauses": [
              {
                "number": "1",
                "text": "Kenya consists of the territory and territorial waters comprising Kenya on the effective date, and any additional territory and territorial waters as defined by an Act of Parliament.",
                "sub_clauses": []
              }
            ]
          },
          {
            "local_number": "3",
            "global_number": "6",
            "title": "Devolution and access to services.",
            "clauses": [
              {
                "number": "1",
                "text": "(1) The territory of Kenya is divided into the counties specified in the First Schedule.",
                "sub_clauses": [
                  {
                    "letter": "a",
                    "text": "The governments at the national and county levels are distinct and inter- dependent and shall conduct their mutual relations on the basis of consultation and cooperation."
                  },
                  {
                    "letter": "b",
                    "text": "A national State organ shall ensure reasonable access to its services in all parts of the Republic, so far as it is appropriate to do so having regard to the nature of the service."
                  }
                ]
              }
            ]
          },
          {
            "local_number": "4",
            "global_number": "7",
            "title": "National, official and other languages.",
            "clauses": [
              {
                "number": "1",
                "text": "(1) The national language of the Republic is Kiswahili.",
                "sub_clauses": [
                  {
                    "letter": "a",
                    "text": "The official languages of the Republic are Kiswahili and English."
                  },
                  {
                    "letter": "b",
                    "text": "The State shall—"
                  },
                  {
                    "letter": "c",
                    "text": "promote and protect the diversity of language of the people of Kenya; and"
                  },
                  {
                    "letter": "d",
                    "text": "promote the development and use of indigenous languages, Kenyan Sign language, Braille and other communication formats and technologies accessible to persons with disabilities."
                  }
                ]
              }
            ]
          },
          {
            "local_number": "5",
            "global_number": "8",
            "title": "State and religion.",
            "clauses": [
              {
                "number": "1",
                "text": "There shall be no State religion.",
                "sub_clauses": []
              }
            ]
          },
          {
            "local_number": "6",
            "global_number": "9",
            "title": "National symbols and national days.",
            "clauses": [
              {
                "number": "1",
                "text": "(1) The national symbols of the Republic are—",
                "sub_clauses": [
                  {
                    "letter": "a",
                    "text": "the national flag;"
                  },
                  {
                    "letter": "b",
                    "text": "the national anthem;"
                  },
                  {
                    "letter": "c",
                    "text": "the coat of arms; and"
                  },
                  {
                    "letter": "d",
                    "text": "the public seal."
                  },
                  {
                    "letter": "e",
                    "text": "The national symbols are as set out in the Second Schedule."
                  },
                  {
                    "letter": "f",
                    "text": "The national days are—"
                  },
                  {
                    "letter": "g",
                    "text": "Madaraka Day, to be observed on 1st June;"
                  },
                  {
                    "letter": "h",
                    "text": "Mashujaa Day, to be observed on 20th October; and"
                  },
                  {
                    "letter": "i",
                    "text": "Jamhuri Day, to be observed on 12th December."
                  },
                  {
                    "letter": "j",
                    "text": "A national day shall be a public holiday."
                  },
                  {
                    "letter": "k",
                    "text": "Parliament may enact legislation prescribing other public holidays, and providing for observance of public holidays."
                  }
                ]
              }
            ]
          },
          {
            "local_number": "7",
            "global_number": "10",
            "title": "National values and principles of governance.",
            "clauses": [
              {
                "number": "1",
                "text": "(1) The national values and principles of governance in this Article bind all State organs, State officers, public officers and all persons whenever any of them—",
                "sub_clauses": [
                  {
                    "letter": "a",
                    "text": "applies or interprets this Constitution;"
                  },
                  {
                    "letter": "b",
                    "text": "enacts, applies or interprets any law; or"
                  },
                  {
                    "letter": "c",
                    "text": "makes or implements public policy decisions."
                  },
                  {
                    "letter": "d",
                    "text": "The national values and principles of governance include—"
                  },
                  {
                    "letter": "e",
                    "text": "patriotism, national unity, sharing and devolution of power, the rule of law, democracy and participation of the people;"
                  },
                  {
                    "letter": "f",
                    "text": "human dignity, equity, social justice, inclusiveness, equality, human rights, non-discrimination and protection of the marginalised;"
                  },
                  {
                    "letter": "g",
                    "text": "good governance, integrity, transparency and accountability; and"
                  },
                  {
                    "letter": "h",
                    "text": "sustainable development."
                  }
                ]
              }
            ]
          },
          {
            "local_number": "8",
            "global_number": "11",
            "title": "Culture.",
            "clauses": [
              {
                "number": "1",
                "text": "(1) This Constitution recognises culture as the foundation of the nation and as the cumulative civilization of the Kenyan people and nation.",
                "sub_clauses": [
                  {
                    "letter": "a",
                    "text": "The State shall—"
                  },
                  {
                    "letter": "b",
                    "text": "promote all forms of national and cultural expression through literature, the arts, traditional celebrations, science, communication, information, mass media, publications, libraries and other cultural heritage;"
                  },
                  {
                    "letter": "c",
                    "text": "recognise the role of science and indigenous technologies in the development of the nation; and"
                  },
                  {
                    "letter": "d",
                    "text": "promote the intellectual property rights of the people of Kenya."
                  },
                  {
                    "letter": "e",
                    "text": "Parliament shall enact legislation to—"
                  },
                  {
                    "letter": "f",
                    "text": "ensure that communities receive compensation or royalties for the use of their cultures and cultural heritage; and"
                  },
                  {
                    "letter": "g",
                    "text": "recognise and protect the ownership of indigenous seeds and plant varieties, their genetic and diverse characteristics and their use by the communities of Kenya."
                  }
                ]
              }
            ]
          }
        ],
        "parts": [],
        "preamble": ""
      },
      {
        "number": "THREE",
        "title": "Citizenship",
        "articles": [
          {
            "local_number": "1",
            "global_number": "12",
            "title": "Entitlements of citizens.",
            "clauses": [
              {
                "number": "1",
                "text": "(1) Every citizen is entitled to—",
                "sub_clauses": [
                  {
                    "letter": "a",
                    "text": "the rights, privileges and benefits of citizenship, subject to the limits provided or permitted by this Constitution; and"
                  },
                  {
                    "letter": "b",
                    "text": "a Kenyan passport and any document of registration or identification issued by the State to citizens."
                  }
                ]
              },
              {
                "number": "2",
                "text": "(2) A passport or other document referred to in clause (1)(b) may be denied, suspended or confiscated only in accordance with an Act of Parliament that satisfies the criteria referred to in Article 24.",
                "sub_clauses": []
              }
            ]
          },
          {
            "local_number": "2",
            "global_number": "13",
            "title": "Retention and acquisition of citizenship.",
            "clauses": [
              {
                "number": "1",
                "text": "(1) Every person who was a citizen immediately before the effective date retains the same citizenship status as of that date.",
                "sub_clauses": [
                  {
                    "letter": "a",
                    "text": "Citizenship may be acquired by birth or registration."
                  },
                  {
                    "letter": "b",
                    "text": "Citizenship is not lost through marriage or the dissolution of marriage."
                  }
                ]
              }
            ]
          },
          {
            "local_number": "3",
            "global_number": "14",
            "title": "Citizenship by birth.",
            "clauses": [
              {
                "number": "1",
                "text": "(1) A person is a citizen by birth if on the day of the person’s birth, whether or not the person is born in Kenya, either the mother or father of the person is a citizen.",
                "sub_clauses": [
                  {
                    "letter": "a",
                    "text": "Clause (1) applies equally to a person born before the effective date, whether or not the person was born in Kenya, if either the mother or father of the person is or was a citizen."
                  },
                  {
                    "letter": "b",
                    "text": "Parliament may enact legislation limiting the effect of clauses (1) and (2) on the descendents of Kenyan citizens who are born outside Kenya."
                  },
                  {
                    "letter": "c",
                    "text": "A child found in Kenya who is, or appears to be, less than eight years of age, and whose nationality and parents are not known, is presumed to be a citizen by birth."
                  },
                  {
                    "letter": "d",
                    "text": "A person who is a Kenyan citizen by birth and who has ceased to be a Kenyan citizen because the person acquired citizenship of another country, is entitled on application to regain Kenyan citizenship."
                  }
                ]
              }
            ]
          },
          {
            "local_number": "4",
            "global_number": "15",
            "title": "Citizenship by registration.",
            "clauses": [
              {
                "number": "1",
                "text": "(1) A person who has been married to a citizen for a period of at least seven years is entitled on application to be registered as a citizen.",
                "sub_clauses": [
                  {
                    "letter": "a",
                    "text": "A person who has been lawfully resident in Kenya for a continuous period of at least seven years, and who satisfies the conditions prescribed by an Act of Parliament, may apply to be registered as a citizen."
                  },
                  {
                    "letter": "b",
                    "text": "A child who is not a citizen, but is adopted by a citizen, is entitled on application to be registered as a citizen."
                  },
                  {
                    "letter": "c",
                    "text": "Parliament shall enact legislation establishing conditions on which citizenship may be granted to individuals who are citizens of other countries."
                  },
                  {
                    "letter": "d",
                    "text": "This Article applies to a person as from the effective date, but any requirements that must be satisfied before the person is entitled to be registered as a citizen shall be regarded as having been satisfied irrespective of whether the person satisfied them before or after the effective date, or partially before, and partially after, the effective date."
                  }
                ]
              }
            ]
          },
          {
            "local_number": "5",
            "global_number": "16",
            "title": "Dual citizenship.",
            "clauses": [
              {
                "number": "1",
                "text": "A citizen by birth does not lose citizenship by acquiring the citizenship of another country.",
                "sub_clauses": []
              }
            ]
          },
          {
            "local_number": "6",
            "global_number": "17",
            "title": "Revocation of citizenship.",
            "clauses": [
              {
                "number": "1",
                "text": "(1) If a person acquired citizenship by registration, the citizenship may be revoked if—",
                "sub_clauses": [
                  {
                    "letter": "a",
                    "text": "the person acquired the citizenship by fraud, false representation or concealment of any material fact;"
                  },
                  {
                    "letter": "b",
                    "text": "the person has, during any war in which Kenya was engaged, unlawfully traded or communicated with an enemy or been engaged in or associated with any business that was knowingly carried on in such a manner as to assist an enemy in that war;"
                  },
                  {
                    "letter": "c",
                    "text": "the person has, within five years after registration, been convicted of an offence and sentenced to imprisonment for a term of three years or longer; or"
                  },
                  {
                    "letter": "d",
                    "text": "the person has, at any time after registration, been convicted of treason, or of an offence for which—"
                  },
                  {
                    "letter": "e",
                    "text": "a penalty of at least seven years imprisonment may be imposed; or"
                  },
                  {
                    "letter": "f",
                    "text": "a more severe penalty may be imposed."
                  },
                  {
                    "letter": "g",
                    "text": "The citizenship of a person who was presumed to be a citizen by birth, as contemplated in Article 14(4), may be revoked if—"
                  },
                  {
                    "letter": "h",
                    "text": "the citizenship was acquired by fraud, false representation or concealment of any material fact by any person;"
                  },
                  {
                    "letter": "i",
                    "text": "the nationality or parentage of the person becomes known, and reveals that the person was a citizen of another country; or"
                  },
                  {
                    "letter": "j",
                    "text": "the age of the person becomes known, and reveals that the person was older than eight years when found in Kenya."
                  }
                ]
              }
            ]
          },
          {
            "local_number": "7",
            "global_number": "18",
            "title": "Legislation on citizenship.",
            "clauses": [
              {
                "number": "1",
                "text": "Parliament shall enact legislation—",
                "sub_clauses": [
                  {
                    "letter": "a",
                    "text": "prescribing procedures by which a person may become a citizen;"
                  },
                  {
                    "letter": "b",
                    "text": "governing entry into and residence in Kenya;"
                  },
                  {
                    "letter": "c",
                    "text": "providing for the status of permanent residents;"
                  },
                  {
                    "letter": "d",
                    "text": "providing for voluntary renunciation of citizenship;"
                  },
                  {
                    "letter": "e",
                    "text": "prescribing procedures for revocation of citizenship;"
                  },
                  {
                    "letter": "f",
                    "text": "prescribing the duties and rights of citizens; and"
                  },
                  {
                    "letter": "g",
                    "text": "generally giving effect to the provisions of this Chapter."
                  }
                ]
              }
            ]
          }
        ],
        "parts": [],
        "preamble": ""
      },
      {
        "number": "FOUR",
        "title": "The Bill of Rights",
        "articles": [],
        "parts": [
          {
            "number": "1",
            "title": "General Provisions Relating to the Bill of Rights",
            "articles": [
              {
                "local_number": "1",
                "global_number": "19",
                "title": "Rights and fundamental freedoms.",
                "clauses": [
                  {
                    "number": "1",
                    "text": "(1) The Bill of Rights is an integral part of Kenya’s democratic state and is the framework for social, economic and cultural policies.",
                    "sub_clauses": [
                      {
                        "letter": "a",
                        "text": "The purpose of recognising and protecting human rights and fundamental freedoms is to preserve the dignity of individuals and communities and to promote social justice and the realisation of the potential of all human beings."
                      },
                      {
                        "letter": "b",
                        "text": "The rights and fundamental freedoms in the Bill of Rights—"
                      },
                      {
                        "letter": "c",
                        "text": "belong to each individual and are not granted by the State;"
                      },
                      {
                        "letter": "d",
                        "text": "do not exclude other rights and fundamental freedoms not in the Bill of Rights, but recognised or conferred by law, except to the extent that they are inconsistent with this Chapter; and"
                      },
                      {
                        "letter": "e",
                        "text": "are subject only to the limitations contemplated in this Constitution."
                      }
                    ]
                  }
                ]
              },
              {
                "local_number": "2",
                "global_number": "20",
                "title": "Application of Bill of Rights.",
                "clauses": [
                  {
                    "number": "1",
                    "text": "(1) The Bill of Rights applies to all law and binds all State organs and all persons.",
                    "sub_clauses": [
                      {
                        "letter": "a",
                        "text": "Every person shall enjoy the rights and fundamental freedoms in the Bill of Rights to the greatest extent consistent with the nature of the right or fundamental freedom."
                      },
                      {
                        "letter": "b",
                        "text": "In applying a provision of the Bill of Rights, a court shall—"
                      },
                      {
                        "letter": "c",
                        "text": "develop the law to the extent that it does not give effect to a right or fundamental freedom; and"
                      },
                      {
                        "letter": "d",
                        "text": "adopt the interpretation that most favours the enforcement of a right or fundamental freedom."
                      },
                      {
                        "letter": "e",
                        "text": "In interpreting the Bill of Rights, a court, tribunal or other authority shall promote—"
                      },
                      {
                        "letter": "f",
                        "text": "the values that underlie an open and democratic society based on human dignity, equality, equity and freedom; and"
                      },
                      {
                        "letter": "g",
                        "text": "the spirit, purport and objects of the Bill of Rights."
                      },
                      {
                        "letter": "h",
                        "text": "In applying any right under Article 43, if the State claims that it does not have the resources to implement the right, a court, tribunal or other authority shall be guided by the following principles—"
                      },
                      {
                        "letter": "i",
                        "text": "it is the responsibility of the State to show that the resources are not available;"
                      },
                      {
                        "letter": "j",
                        "text": "in allocating resources, the State shall give priority to ensuring the widest possible enjoyment of the right or fundamental freedom having regard to prevailing circumstances, including the vulnerability of particular groups or individuals; and"
                      },
                      {
                        "letter": "k",
                        "text": "the court, tribunal or other authority may not interfere with a decision by a State organ concerning the allocation of available resources, solely on the basis that it would have reached a different conclusion."
                      }
                    ]
                  }
                ]
              },
              {
                "local_number": "3",
                "global_number": "21",
                "title": "Implementation of rights and fundamental freedoms.",
                "clauses": [
                  {
                    "number": "1",
                    "text": "(1) It is a fundamental duty of the State and every State organ to observe, respect, protect, promote and fulfil the rights and fundamental freedoms in the Bill of Rights.",
                    "sub_clauses": [
                      {
                        "letter": "a",
                        "text": "The State shall take legislative, policy and other measures, including the setting of standards, to achieve the progressive realisation of the rights guaranteed under Article 43."
                      },
                      {
                        "letter": "b",
                        "text": "All State organs and all public officers have the duty to address the needs of vulnerable groups within society, including women, older members of society, persons with disabilities, children, youth, members of minority or marginalised communities, and members of particular ethnic, religious or cultural communities."
                      },
                      {
                        "letter": "c",
                        "text": "The State shall enact and implement legislation to fulfil its international obligations in respect of human rights and fundamental freedoms."
                      }
                    ]
                  }
                ]
              },
              {
                "local_number": "4",
                "global_number": "22",
                "title": "Enforcement of Bill of Rights.",
                "clauses": [
                  {
                    "number": "1",
                    "text": "(1) Every person has the right to institute court proceedings claiming that a right or fundamental freedom in the Bill of Rights has been denied, violated or infringed, or is threatened.",
                    "sub_clauses": [
                      {
                        "letter": "a",
                        "text": "In addition to a person acting in their own interest, court proceedings under clause (1) may be instituted by—"
                      },
                      {
                        "letter": "b",
                        "text": "a person acting on behalf of another person who cannot act in their own name;"
                      },
                      {
                        "letter": "c",
                        "text": "a person acting as a member of, or in the interest of, a group or class of persons;"
                      },
                      {
                        "letter": "d",
                        "text": "a person acting in the public interest; or"
                      },
                      {
                        "letter": "e",
                        "text": "an association acting in the interest of one or more of its members."
                      },
                      {
                        "letter": "f",
                        "text": "The Chief Justice shall make rules providing for the court proceedings referred to in this Article, which shall satisfy the criteria that—"
                      },
                      {
                        "letter": "g",
                        "text": "the rights of standing provided for in clause (2) are fully facilitated;"
                      },
                      {
                        "letter": "h",
                        "text": "formalities relating to the proceedings, including commencement of the proceedings, are kept to the minimum, and in particular that the court shall, if necessary, entertain proceedings on the basis of informal documentation;"
                      },
                      {
                        "letter": "i",
                        "text": "no fee may be charged for commencing the proceedings;"
                      },
                      {
                        "letter": "j",
                        "text": "the court, while observing the rules of natural justice, shall not be unreasonably restricted by procedural technicalities; and"
                      },
                      {
                        "letter": "k",
                        "text": "an organisation or individual with particular expertise may, with the leave of the court, appear as a friend of the court."
                      },
                      {
                        "letter": "l",
                        "text": "The absence of rules contemplated in clause (3) does not limit the right of any person to commence court proceedings under this Article, and to have the matter heard and determined by a court."
                      }
                    ]
                  }
                ]
              },
              {
                "local_number": "5",
                "global_number": "23",
                "title": "Article 5",
                "clauses": [
                  {
                    "number": "1",
                    "text": "(1) The High Court has jurisdiction, in accordance with Article 165, to hear and determine applications for redress of a denial, violation or infringement of, or threat to, a right or fundamental freedom in the Bill of Rights.",
                    "sub_clauses": [
                      {
                        "letter": "a",
                        "text": "Parliament shall enact legislation to give original jurisdiction in appropriate cases to subordinate courts to hear and determine applications for redress of a denial, violation or infringement of, or threat to, a right or fundamental freedom in the Bill of Rights."
                      },
                      {
                        "letter": "b",
                        "text": "In any proceedings brought under Article 22, a court may grant appropriate relief, including—"
                      }
                    ]
                  }
                ]
              },
              {
                "local_number": "6",
                "global_number": "24",
                "title": "A Declaration of Rights;",
                "clauses": [
                  {
                    "number": "1",
                    "text": "an injunction;",
                    "sub_clauses": [
                      {
                        "letter": "a",
                        "text": "a conservatory order;"
                      },
                      {
                        "letter": "b",
                        "text": "a declaration of invalidity of any law that denies, violates, infringes, or threatens a right or fundamental freedom in the Bill of Rights and is not justified under Article 24;"
                      },
                      {
                        "letter": "c",
                        "text": "an order for compensation; and"
                      },
                      {
                        "letter": "d",
                        "text": "an order of judicial review."
                      }
                    ]
                  }
                ]
              },
              {
                "local_number": "7",
                "global_number": "25",
                "title": "Limitation of rights and fundamental freedoms.",
                "clauses": [
                  {
                    "number": "1",
                    "text": "(1) A right or fundamental freedom in the Bill of Rights shall not be limited except by law, and then only to the extent that the limitation is reasonable and justifiable in an open and democratic society based on human dignity, equality and freedom, taking into account all relevant factors, including—",
                    "sub_clauses": [
                      {
                        "letter": "a",
                        "text": "the nature of the right or fundamental freedom;"
                      },
                      {
                        "letter": "b",
                        "text": "the importance of the purpose of the limitation;"
                      },
                      {
                        "letter": "c",
                        "text": "the nature and extent of the limitation;"
                      },
                      {
                        "letter": "d",
                        "text": "the need to ensure that the enjoyment of rights and fundamental freedoms by any individual does not prejudice the rights and fundamental freedoms of others; and"
                      },
                      {
                        "letter": "e",
                        "text": "the relation between the limitation and its purpose and whether there are less restrictive means to achieve the purpose."
                      },
                      {
                        "letter": "f",
                        "text": "Despite clause (1), a provision in legislation limiting a right or fundamental freedom—"
                      },
                      {
                        "letter": "g",
                        "text": "in the case of a provision enacted or amended on or after the effective date, is not valid unless the legislation specifically expresses the intention to limit that right or fundamental freedom, and the nature and extent of the limitation;"
                      },
                      {
                        "letter": "h",
                        "text": "shall not be construed as limiting the right or fundamental freedom unless the provision is clear and specific about the right or freedom to be limited and the nature and extent of the limitation; and"
                      },
                      {
                        "letter": "i",
                        "text": "shall not limit the right or fundamental freedom so far as to derogate from its core or essential content."
                      },
                      {
                        "letter": "j",
                        "text": "The State or a person seeking to justify a particular limitation shall demonstrate to the court, tribunal or other authority that the requirements of this Article have been satisfied."
                      },
                      {
                        "letter": "k",
                        "text": "The provisions of this Chapter on equality shall be qualified to the extent strictly necessary for the application of Muslim law before the Kadhis’ courts, to persons who profess the Muslim religion, in matters relating to personal status, marriage, divorce and inheritance."
                      },
                      {
                        "letter": "l",
                        "text": "Despite clause (1) and (2), a provision in legislation may limit the application of the rights or fundamental freedoms in the following provisions to persons serving in the Kenya Defence Forces or the National Police Service—"
                      }
                    ]
                  }
                ]
              },
              {
                "local_number": "31",
                "global_number": "26",
                "title": "Privacy;",
                "clauses": []
              },
              {
                "local_number": "36",
                "global_number": "27",
                "title": "Freedom of Association;",
                "clauses": []
              },
              {
                "local_number": "37",
                "global_number": "28",
                "title": "Assembly, Demonstration, Picketing and Petition;",
                "clauses": []
              },
              {
                "local_number": "41",
                "global_number": "29",
                "title": "Labour Relations;",
                "clauses": []
              },
              {
                "local_number": "43",
                "global_number": "30",
                "title": "Economic and Social Rights; And",
                "clauses": []
              },
              {
                "local_number": "49",
                "global_number": "31",
                "title": "Rights of arrested persons.",
                "clauses": []
              },
              {
                "local_number": "50",
                "global_number": "32",
                "title": "Fundamental Rights and freedoms that may not be limited.",
                "clauses": [
                  {
                    "number": "1",
                    "text": "Despite any other provision in this Constitution, the following rights and fundamental freedoms shall not be limited—",
                    "sub_clauses": [
                      {
                        "letter": "a",
                        "text": "freedom from torture and cruel, inhuman or degrading treatment or punishment;"
                      }
                    ]
                  }
                ]
              },
              {
                "local_number": "51",
                "global_number": "33",
                "title": "Freedom from Slavery or Servitude;",
                "clauses": [
                  {
                    "number": "1",
                    "text": "the right to a fair trial; and",
                    "sub_clauses": [
                      {
                        "letter": "a",
                        "text": "the right to an order of habeas corpus."
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "number": "2",
            "title": "Rights and Fundamental Freedoms",
            "articles": [
              {
                "local_number": "1",
                "global_number": "34",
                "title": "Right to life.",
                "clauses": [
                  {
                    "number": "1",
                    "text": "(1) Every person has the right to life.",
                    "sub_clauses": [
                      {
                        "letter": "a",
                        "text": "The life of a person begins at conception."
                      },
                      {
                        "letter": "b",
                        "text": "A person shall not be deprived of life intentionally, except to the extent authorised by this Constitution or other written law."
                      },
                      {
                        "letter": "c",
                        "text": "Abortion is not permitted unless, in the opinion of a trained health professional, there is need for emergency treatment, or the life or health of the mother is in danger, or if permitted by any other written law."
                      }
                    ]
                  }
                ]
              },
              {
                "local_number": "2",
                "global_number": "35",
                "title": "Equality and freedom from discrimination.",
                "clauses": [
                  {
                    "number": "1",
                    "text": "(1) Every person is equal before the law and has the right to equal protection and equal benefit of the law.",
                    "sub_clauses": [
                      {
                        "letter": "a",
                        "text": "Equality includes the full and equal enjoyment of all rights and fundamental freedoms."
                      },
                      {
                        "letter": "b",
                        "text": "Women and men have the right to equal treatment, including the right to equal opportunities in political, economic, cultural and social spheres."
                      },
                      {
                        "letter": "c",
                        "text": "The State shall not discriminate directly or indirectly against any person on any ground, including race, sex, pregnancy, marital status, health status, ethnic or social origin, colour, age, disability, religion, conscience, belief, culture, dress, language or birth."
                      },
                      {
                        "letter": "d",
                        "text": "A person shall not discriminate directly or indirectly against another person on any of the grounds specified or contemplated in clause (4)."
                      },
                      {
                        "letter": "e",
                        "text": "To give full effect to the realisation of the rights guaranteed under this Article, the State shall take legislative and other measures, including affirmative action programmes and policies designed to redress any disadvantage suffered by individuals or groups because of past discrimination."
                      },
                      {
                        "letter": "f",
                        "text": "Any measure taken under clause (6) shall adequately provide for any benefits to be on the basis of genuine need."
                      },
                      {
                        "letter": "g",
                        "text": "In addition to the measures contemplated in clause (6), the State shall take legislative and other measures to implement the principle that not more than two- thirds of the members of elective or appointive bodies shall be of the same gender."
                      }
                    ]
                  }
                ]
              },
              {
                "local_number": "3",
                "global_number": "36",
                "title": "Human dignity.",
                "clauses": [
                  {
                    "number": "1",
                    "text": "Every person has inherent dignity and the right to have that dignity respected and protected.",
                    "sub_clauses": []
                  }
                ]
              },
              {
                "local_number": "4",
                "global_number": "37",
                "title": "Freedom and security of the person.",
                "clauses": [
                  {
                    "number": "1",
                    "text": "Every person has the right to freedom and security of the person, which includes the right not to be—",
                    "sub_clauses": [
                      {
                        "letter": "a",
                        "text": "deprived of freedom arbitrarily or without just cause;"
                      },
                      {
                        "letter": "b",
                        "text": "detained without trial, except during a state of emergency, in which case the detention is subject to Article 58;"
                      },
                      {
                        "letter": "c",
                        "text": "subjected to any form of violence from either public or private sources;"
                      },
                      {
                        "letter": "d",
                        "text": "subjected to torture in any manner, whether physical or psychological;"
                      },
                      {
                        "letter": "e",
                        "text": "subjected to corporal punishment; or"
                      },
                      {
                        "letter": "f",
                        "text": "treated or punished in a cruel, inhuman or degrading manner."
                      }
                    ]
                  }
                ]
              },
              {
                "local_number": "5",
                "global_number": "38",
                "title": "Slavery, servitude and forced labour.",
                "clauses": [
                  {
                    "number": "1",
                    "text": "(1) A person shall not be held in slavery or servitude.",
                    "sub_clauses": []
                  },
                  {
                    "number": "2",
                    "text": "(2) A person shall not be required to perform forced labour.",
                    "sub_clauses": []
                  }
                ]
              },
              {
                "local_number": "6",
                "global_number": "39",
                "title": "Privacy.",
                "clauses": [
                  {
                    "number": "1",
                    "text": "Every person has the right to privacy, which includes the right not to have—",
                    "sub_clauses": [
                      {
                        "letter": "a",
                        "text": "their person, home or property searched;"
                      },
                      {
                        "letter": "b",
                        "text": "their possessions seized;"
                      },
                      {
                        "letter": "c",
                        "text": "information relating to their family or private affairs unnecessarily required or revealed; or"
                      },
                      {
                        "letter": "d",
                        "text": "the privacy of their communications infringed."
                      }
                    ]
                  }
                ]
              },
              {
                "local_number": "7",
                "global_number": "40",
                "title": "Freedom of conscience, religion, belief and opinion.",
                "clauses": [
                  {
                    "number": "1",
                    "text": "(1) Every person has the right to freedom of conscience, religion, thought, belief and opinion.",
                    "sub_clauses": [
                      {
                        "letter": "a",
                        "text": "Every person has the right, either individually or in community with others, in public or in private, to manifest any religion or belief through worship, practice, teaching or observance, including observance of a day of worship."
                      },
                      {
                        "letter": "b",
                        "text": "A person may not be denied access to any institution, employment or facility, or the enjoyment of any right, because of the person’s belief or religion."
                      },
                      {
                        "letter": "c",
                        "text": "A person shall not be compelled to act, or engage in any act, that is contrary to the person’s belief or religion."
                      }
                    ]
                  }
                ]
              },
              {
                "local_number": "8",
                "global_number": "41",
                "title": "Freedom of expression.",
                "clauses": [
                  {
                    "number": "1",
                    "text": "(1) Every person has the right to freedom of expression, which includes—",
                    "sub_clauses": [
                      {
                        "letter": "a",
                        "text": "freedom to seek, receive or impart information or ideas;"
                      }
                    ]
                  }
                ]
              },
              {
                "local_number": "9",
                "global_number": "42",
                "title": "Freedom of Artistic Creativity; And",
                "clauses": [
                  {
                    "number": "1",
                    "text": "academic freedom and freedom of scientific research.",
                    "sub_clauses": [
                      {
                        "letter": "a",
                        "text": "The right to freedom of expression does not extend to—"
                      },
                      {
                        "letter": "b",
                        "text": "propaganda for war;"
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ],
        "preamble": ""
      }
    ]
  }
}