{
  "constitution": {
    "title": "The Constitution of Kenya",
    "preamble": "",
    "chapters": [
      {
        "number": "ONE",
        "title": "Sovereignty of the people.",
        "articles": [],
        "parts": [],
        "preamble": ""
      },
      {
        "number": "TWO",
        "title": "Declaration of the Republic.",
        "articles": [],
        "parts": [],
        "preamble": ""
      },
      {
        "number": "THREE",
        "title": "Entitlements of citizens.",
        "articles": [
          {
            "local_number": "1",
            "global_number": "1",
            "title": "Prescribing the Duties and Rights of Citizens; And",
            "clauses": [
              {
                "number": "1",
                "text": "generally giving effect to the provisions of this Chapter.",
                "sub_clauses": []
              }
            ]
          }
        ],
        "parts": [],
        "preamble": ""
      },
      {
        "number": "FOUR",
        "title": "Rights and fundamental freedoms.",
        "articles": [],
        "parts": [
          {
            "number": "1",
            "title": "General Provisions to the Bill of Rights",
            "articles": [
              {
                "local_number": "1",
                "global_number": "2",
                "title": "Application of Bill of Rights.",
                "clauses": [
                  {
                    "number": "1",
                    "text": "(1) The Bill of Rights applies to all law and binds all State organs and all persons. Every person shall enjoy the rights and fundamental freedoms in the Bill of Rights to the greatest extent consistent with the nature of the right or fundamental freedom. In applying a provision of the Bill of Rights, a court shall— develop the law to the extent that it does not give effect to a right or fundamental freedom; and adopt the interpretation that most favours the enforcement of a right or fundamental freedom. In interpreting the Bill of Rights, a court, tribunal or other authority shall promote— the values that underlie an open and democratic society based on human dignity, equality, equity and freedom; and the spirit, purport and objects of the Bill of Rights. In applying any right under Article 43, if the State claims that it does not have the resources to implement the right, a court, tribunal or other authority shall be guided by the following principles— it is the responsibility of the State to show that the resources are not available; in allocating resources, the State shall give priority to ensuring the widest possible enjoyment of the right or fundamental freedom having regard to prevailing circumstances, including the vulnerability of particular groups or individuals; and the court, tribunal or other authority may not interfere with a decision by a State organ concerning the allocation of available resources, solely on the basis that it would have reached a different conclusion.",
                    "sub_clauses": []
                  }
                ]
              },
              {
                "local_number": "2",
                "global_number": "3",
                "title": "Implementation of rights and fundamental freedoms.",
                "clauses": [
                  {
                    "number": "1",
                    "text": "(1) It is a fundamental duty of the State and every State organ to observe, respect, protect, promote and fulfil the rights and fundamental freedoms in the Bill of Rights. The State shall take legislative, policy and other measures, including the setting of standards, to achieve the progressive realisation of the rights guaranteed under Article 43. All State organs and all public officers have the duty to address the needs of vulnerable groups within society, including women, older members of society, persons with disabilities, children, youth, members of minority or marginalised communities, and members of particular ethnic, religious or cultural communities. The State shall enact and implement legislation to fulfil its international obligations in respect of human rights and fundamental freedoms.",
                    "sub_clauses": []
                  }
                ]
              },
              {
                "local_number": "3",
                "global_number": "4",
                "title": "Enforcement of Bill of Rights.",
                "clauses": [
                  {
                    "number": "1",
                    "text": "(1) Every person has the right to institute court proceedings claiming that a right or fundamental freedom in the Bill of Rights has been denied, violated or infringed, or is threatened. In addition to a person acting in their own interest, court proceedings under clause",
                    "sub_clauses": []
                  },
                  {
                    "number": "2",
                    "text": "(1) may be instituted by— a person acting on behalf of another person who cannot act in their own name; a person acting as a member of, or in the interest of, a group or class of persons; a person acting in the public interest; or an association acting in the interest of one or more of its members. The Chief Justice shall make rules providing for the court proceedings referred to in this Article, which shall satisfy the criteria that— the rights of standing provided for in clause",
                    "sub_clauses": []
                  },
                  {
                    "number": "3",
                    "text": "(2) are fully facilitated; formalities relating to the proceedings, including commencement of the proceedings, are kept to the minimum, and in particular that the court shall, if necessary, entertain proceedings on the basis of informal documentation; no fee may be charged for commencing the proceedings; the court, while observing the rules of natural justice, shall not be unreasonably restricted by procedural technicalities; and an organisation or individual with particular expertise may, with the leave of the court, appear as a friend of the court. The absence of rules contemplated in clause",
                    "sub_clauses": []
                  },
                  {
                    "number": "4",
                    "text": "(3) does not limit the right of any person to commence court proceedings under this Article, and to have the matter heard and determined by a court. Authority of courts to uphold and enforce the Bill of Rights.",
                    "sub_clauses": []
                  },
                  {
                    "number": "5",
                    "text": "(1) The High Court has jurisdiction, in accordance with Article 165, to hear and determine applications for redress of a denial, violation or infringement of, or threat to, a right or fundamental freedom in the Bill of Rights. Parliament shall enact legislation to give original jurisdiction in appropriate cases to subordinate courts to hear and determine applications for redress of a denial, violation or infringement of, or threat to, a right or fundamental freedom in the Bill of Rights. In any proceedings brought under Article 22, a court may grant appropriate relief, including—",
                    "sub_clauses": []
                  }
                ]
              },
              {
                "local_number": "4",
                "global_number": "5",
                "title": "A Declaration of Rights;",
                "clauses": [
                  {
                    "number": "1",
                    "text": "an injunction; a conservatory order; a declaration of invalidity of any law that denies, violates, infringes, or threatens a right or fundamental freedom in the Bill of Rights and is not justified under Article 24; an order for compensation; and an order of judicial review.",
                    "sub_clauses": []
                  }
                ]
              },
              {
                "local_number": "5",
                "global_number": "6",
                "title": "Limitation of rights and fundamental freedoms.",
                "clauses": [
                  {
                    "number": "1",
                    "text": "(1) A right or fundamental freedom in the Bill of Rights shall not be limited except by law, and then only to the extent that the limitation is reasonable and justifiable in an open and democratic society based on human dignity, equality and freedom, taking into account all relevant factors, including—",
                    "sub_clauses": []
                  }
                ]
              },
              {
                "local_number": "6",
                "global_number": "7",
                "title": "The Nature of the Right or Fundamental Freedom;",
                "clauses": [
                  {
                    "number": "1",
                    "text": "the importance of the purpose of the limitation; the nature and extent of the limitation; the need to ensure that the enjoyment of rights and fundamental freedoms by any individual does not prejudice the rights and fundamental freedoms of others; and the relation between the limitation and its purpose and whether there are less restrictive means to achieve the purpose. Despite clause (1), a provision in legislation limiting a right or fundamental freedom— in the case of a provision enacted or amended on or after the effective date, is not valid unless the legislation specifically expresses the intention to limit that right or fundamental freedom, and the nature and extent of the limitation; shall not be construed as limiting the right or fundamental freedom unless the provision is clear and specific about the right or freedom to be limited and the nature and extent of the limitation; and shall not limit the right or fundamental freedom so far as to derogate from its core or essential content. The State or a person seeking to justify a particular limitation shall demonstrate to the court, tribunal or other authority that the requirements of this Article have been satisfied. The provisions of this Chapter on equality shall be qualified to the extent strictly necessary for the application of Muslim law before the Kadhis’ courts, to persons who profess the Muslim religion, in matters relating to personal status, marriage, divorce and inheritance. Despite clause",
                    "sub_clauses": []
                  },
                  {
                    "number": "2",
                    "text": "(1) and (2), a provision in legislation may limit the application of the rights or fundamental freedoms in the following provisions to persons serving in the Kenya Defence Forces or the National Police Service—",
                    "sub_clauses": []
                  }
                ]
              },
              {
                "local_number": "7",
                "global_number": "8",
                "title": "Privacy;",
                "clauses": [
                  {
                    "number": "1",
                    "text": "(31) Privacy;",
                    "sub_clauses": []
                  }
                ]
              },
              {
                "local_number": "8",
                "global_number": "9",
                "title": "Freedom of Association;",
                "clauses": [
                  {
                    "number": "1",
                    "text": "(36) Freedom of association;",
                    "sub_clauses": []
                  }
                ]
              },
              {
                "local_number": "9",
                "global_number": "10",
                "title": "Assembly, demonstration, picketing...",
                "clauses": [
                  {
                    "number": "1",
                    "text": "(37) Assembly, demonstration, picketing and petition;",
                    "sub_clauses": []
                  }
                ]
              },
              {
                "local_number": "10",
                "global_number": "11",
                "title": "Labour Relations;",
                "clauses": [
                  {
                    "number": "1",
                    "text": "(41) Labour relations;",
                    "sub_clauses": []
                  }
                ]
              },
              {
                "local_number": "11",
                "global_number": "12",
                "title": "Economic and social...",
                "clauses": [
                  {
                    "number": "1",
                    "text": "(43) Economic and social rights; and",
                    "sub_clauses": []
                  }
                ]
              },
              {
                "local_number": "12",
                "global_number": "13",
                "title": "Rights of arrested...",
                "clauses": [
                  {
                    "number": "1",
                    "text": "(49) Rights of arrested persons.",
                    "sub_clauses": []
                  }
                ]
              },
              {
                "local_number": "13",
                "global_number": "14",
                "title": "Fundamental Rights and freedoms that may not be limited.",
                "clauses": [
                  {
                    "number": "1",
                    "text": "Despite any other provision in this Constitution, the following rights and fundamental freedoms shall not be limited— freedom from torture and cruel, inhuman or degrading treatment or punishment;",
                    "sub_clauses": []
                  }
                ]
              },
              {
                "local_number": "14",
                "global_number": "15",
                "title": "Freedom from Slavery or Servitude;",
                "clauses": [
                  {
                    "number": "1",
                    "text": "the right to a fair trial; and the right to an order of habeas corpus.",
                    "sub_clauses": []
                  }
                ]
              }
            ]
          },
          {
            "number": "2",
            "title": "Rights and Fundamental Freedoms",
            "articles": [
              {
                "local_number": "15",
                "global_number": "16",
                "title": "Right to life.",
                "clauses": [
                  {
                    "number": "1",
                    "text": "(1) Every person has the right to life. The life of a person begins at conception. A person shall not be deprived of life intentionally, except to the extent authorised by this Constitution or other written law. Abortion is not permitted unless, in the opinion of a trained health professional, there is need for emergency treatment, or the life or health of the mother is in danger, or if permitted by any other written law.",
                    "sub_clauses": []
                  }
                ]
              },
              {
                "local_number": "16",
                "global_number": "17",
                "title": "Equality and freedom from discrimination.",
                "clauses": [
                  {
                    "number": "1",
                    "text": "(1) Every person is equal before the law and has the right to equal protection and equal benefit of the law. Equality includes the full and equal enjoyment of all rights and fundamental freedoms. Women and men have the right to equal treatment, including the right to equal opportunities in political, economic, cultural and social spheres. The State shall not discriminate directly or indirectly against any person on any ground, including race, sex, pregnancy, marital status, health status, ethnic or social origin, colour, age, disability, religion, conscience, belief, culture, dress, language or birth. A person shall not discriminate directly or indirectly against another person on any of the grounds specified or contemplated in clause (4). To give full effect to the realisation of the rights guaranteed under this Article, the State shall take legislative and other measures, including affirmative action programmes and policies designed to redress any disadvantage suffered by individuals or groups because of past discrimination. Any measure taken under clause",
                    "sub_clauses": []
                  },
                  {
                    "number": "2",
                    "text": "(6) shall adequately provide for any benefits to be on the basis of genuine need. In addition to the measures contemplated in clause (6), the State shall take legislative and other measures to implement the principle that not more than two- thirds of the members of elective or appointive bodies shall be of the same gender. Human dignity. Every person has inherent dignity and the right to have that dignity respected and protected.",
                    "sub_clauses": []
                  }
                ]
              },
              {
                "local_number": "17",
                "global_number": "18",
                "title": "Freedom and security of the person.",
                "clauses": [
                  {
                    "number": "1",
                    "text": "Every person has the right to freedom and security of the person, which includes the right not to be—",
                    "sub_clauses": []
                  }
                ]
              },
              {
                "local_number": "18",
                "global_number": "19",
                "title": "Deprived of Freedom Arbitrarily or Without Just Cause;",
                "clauses": [
                  {
                    "number": "1",
                    "text": "detained without trial, except during a state of emergency, in which case the detention is subject to Article 58; subjected to any form of violence from either public or private sources; subjected to torture in any manner, whether physical or psychological; subjected to corporal punishment; or treated or punished in a cruel, inhuman or degrading manner. Slavery, servitude and forced labour.",
                    "sub_clauses": []
                  },
                  {
                    "number": "2",
                    "text": "(1) A person shall not be held in slavery or servitude.",
                    "sub_clauses": []
                  },
                  {
                    "number": "3",
                    "text": "(2) A person shall not be required to perform forced labour. Privacy. Every person has the right to privacy, which includes the right not to have— their person, home or property searched; their possessions seized; information relating to their family or private affairs unnecessarily required or revealed; or the privacy of their communications infringed.",
                    "sub_clauses": []
                  }
                ]
              },
              {
                "local_number": "19",
                "global_number": "20",
                "title": "Freedom of conscience, religion, belief and opinion.",
                "clauses": [
                  {
                    "number": "1",
                    "text": "(1) Every person has the right to freedom of conscience, religion, thought, belief and opinion. Every person has the right, either individually or in community with others, in public or in private, to manifest any religion or belief through worship, practice, teaching or observance, including observance of a day of worship. A person may not be denied access to any institution, employment or facility, or the enjoyment of any right, because of the person’s belief or religion. A person shall not be compelled to act, or engage in any act, that is contrary to the person’s belief or religion.",
                    "sub_clauses": []
                  }
                ]
              },
              {
                "local_number": "20",
                "global_number": "21",
                "title": "Freedom of expression.",
                "clauses": [
                  {
                    "number": "1",
                    "text": "(1) Every person has the right to freedom of expression, which includes—",
                    "sub_clauses": []
                  }
                ]
              },
              {
                "local_number": "21",
                "global_number": "22",
                "title": "freedom to seek,...",
                "clauses": [
                  {
                    "number": "1",
                    "text": "(7) freedom to seek, receive or impart information or ideas;",
                    "sub_clauses": []
                  }
                ]
              },
              {
                "local_number": "22",
                "global_number": "23",
                "title": "freedom of artistic...",
                "clauses": [
                  {
                    "number": "1",
                    "text": "(8) freedom of artistic creativity; and",
                    "sub_clauses": []
                  }
                ]
              },
              {
                "local_number": "23",
                "global_number": "24",
                "title": "academic freedom and freedom of scientific research.",
                "clauses": [
                  {
                    "number": "1",
                    "text": "The right to freedom of expression does not extend to— propaganda for war;",
                    "sub_clauses": []
                  }
                ]
              }
            ]
          }
        ],
        "preamble": ""
      }
    ]
  }
}